Renova/src/DataProcessors/ЗагрузкаСервисныхЦентров/ЗагрузкаСервисныхЦентров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСервисныхЦентров</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Renova/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <owners>Catalog.РегионыСервиса</owners>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегионСервиса</name>
    <type>
      <types>CatalogRef.РегионыСервиса</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Компетенции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Особенности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Код7ки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>IDСайта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Email</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Renova/src/DataProcessors/ЗагрузкаСервисныхЦентров/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	ПоказатьОповещениеПользователя("Строк в таблице: " + Объект.ТаблицаЗагрузки.Количество());;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТабЗн = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтотОбъект, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТабЗн);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	СозданоЭлементов = 0;
	ТаблицаЗначений = Объект.ТаблицаЗагрузки.Выгрузить();
	//КоличествоСтрокВТаблице = ТаблицаЗначений.Количество();
	// 1. Собираем все уникальные region_id для поиска
	// 2. Собираем все уникальные ID для проверки существующих контрагентов
	УникальныеРегионы = Новый Массив;
	УникальныеID = Новый Массив;
	
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл
		// Для регионов
		Если УникальныеРегионы.Найти(СтрокаДанных.region_id) = Неопределено Тогда  
			УникальныеРегионы.Добавить(СтрокаДанных.region_id);
			Если СтрокаДанных.region_id = "" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		// Для ID контрагентов
		Если УникальныеID.Найти(СтрокаДанных.id) = Неопределено Тогда  
			УникальныеID.Добавить(СтрокаДанных.id);
		КонецЕсли;
	КонецЦикла;
	
	// 3. Получаем соответствие IDСайта -> Ссылка на регион
	СоответствиеРегионов = СоответствияСервер.ПолучитьСоответствиеРегионов(УникальныеРегионы);
	
	// 4. Получаем существующие контрагенты по IDСайта
	СоответствиеСуществующихКонтрагентов = СоответствияСервер.ПолучитьСоответствиеКонтрагентов(УникальныеID);
	
	// 5. Создаем контрагентов
	Для каждого СтрокаДанных из ТаблицаЗначений Цикл
		
		// Проверяем, существует ли уже контрагент с таким IDСайта
		Если СоответствиеСуществующихКонтрагентов[Число(СтрокаДанных.id)] <> Неопределено Тогда
			// Контрагент уже существует, пропускаем создание
			Продолжить;			
		КонецЕсли; 
		
		НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйЭлемент.IDСайта = СтрокаДанных.id;
		НовыйЭлемент.Наименование = СтрокаДанных.title;
		НовыйЭлемент.Город = СтрокаДанных.city;
		НовыйЭлемент.ЮридическийАдрес = СтрокаДанных.addr;
		НовыйЭлемент.ПочтовыйАдрес = СтрокаДанных.post_addr; 
		НовыйЭлемент.Код7ки = СтрокаДанных.code;
		
		// 6. Устанавливаем регион по соответствию
		Если СтрокаДанных.region_id <> Неопределено Тогда 
			ЧислоID = Число(СтрокаДанных.region_id);
			СсылкаНаРегион = СоответствиеРегионов[ЧислоID];
			Если СсылкаНаРегион <> Неопределено Тогда
				НовыйЭлемент.РегионСервиса = СсылкаНаРегион;
				НовыйЭлемент.Владелец = СсылкаНаРегион; 
			КонецЕсли;
		КонецЕсли;
		
		НовыйЭлемент.Особенности = СтрокаДанных.conditions;
		НовыйЭлемент.Компетенции = СтрокаДанных.note;
		ЧислоАктивен = Число(СтрокаДанных.is_active);
		Если ЧислоАктивен = 1 Тогда 
			НовыйЭлемент.Активен = Истина;
		Иначе
			НовыйЭлемент.Активен = Ложь;
		КонецЕсли;
		
		НовыйЭлемент.Записать();
		СозданоЭлементов = СозданоЭлементов + 1;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю; 
	Текст = СтрШаблон("Загружено и создано %1 элементов справочника", СозданоЭлементов);
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
